<template>
     <ChatModalBaseExt @close="emit('close')">
          <div class="flex h-full w-full">
               <!-- Colonne Gauche : Image -->
               <div class="w-[360px] h-[600px] min-w-[360px]">
                    <img
                         src="https://www.tourisme-brioudesudauvergne.fr/wp-content/uploads/wpetourisme/30745290-diaporama-780x560.jpg"
                         alt="Image Description"
                         class="w-full h-full object-cover rounded-l-[8px] rounded-r-none"
                    />
                    <div class="absolute bottom-2 text-[10px] text-white text-opacity-40 left-[125px]">
                         Brioude - Jérémy Mazet
                    </div>
               </div>
               <!-- Colonne Droite : Contenu -->
               <div class="flex flex-col text-left">
                    <div class="mt-[20px]">
                         <!-- Header -->
                         <div class="flex text-left  px-6">
                              <svg class="my-auto mx-0" height="34" viewBox="0 0 34 34" fill="none" xmlns="http://www.w3.org/2000/svg">
                                   <rect x="0.5" y="0.5" width="33" height="33" rx="16.5" fill="#3866FB"/>
                                   <rect x="0.5" y="0.5" width="33" height="33" rx="16.5" stroke="#9B9B9B"/>
                                   <path d="M28 26.7138L24.8276 20.3586L23.2414 17.1809L23.0034 14.7599H23.6379L26.1759 18.2401C26.2552 18.3158 26.4138 18.3914 26.4931 18.3914C26.731 18.3914 26.969 18.1645 26.969 17.8618C26.969 17.7105 26.8897 17.5592 26.8103 17.4836V17.4079L22.6069 10.9013C22.6069 10.6743 22.5276 10.523 22.369 10.523H22.0517V9.99342L22.2103 9.84211C22.9241 9.61513 23.4 8.93421 23.4 8.10197C23.4 7.11842 22.6069 6.28618 21.5759 6.28618C20.5448 6.28618 19.7517 7.11842 19.7517 8.10197C19.7517 8.85855 20.2276 9.53947 20.9414 9.76645V10.5987H20.8621C20.7828 10.5987 20.7034 10.75 20.6241 10.9013L20.3069 11.2039L19.6724 12.1118L19.1172 12.7928L19.2759 13.4737L19.4345 13.7007L19.9103 14.1546L20.069 16.8783L18.8793 19.148L17.4517 21.9474L15.0724 17.1053L14.9931 16.4243C15.0724 16.4243 15.1517 16.5 15.3103 16.5H16.8172C17.1345 16.5 17.3724 16.3487 17.3724 16.1974V16.1217L17.4517 12.4901C17.4517 12.4901 17.0552 11.6579 16.8966 11.2796C16.7379 10.977 16.2621 10.2961 16.2621 10.2961C16.1828 10.2204 16.1034 10.2204 16.0241 10.2204H15.0724L14.9931 10.1447V10.0691C14.9931 9.8421 14.8345 9.69079 14.5966 9.69079H14.1207V8.78289C14.9138 8.48026 15.469 7.79934 15.469 6.96711C15.469 5.83224 14.5172 5 13.3276 5C12.1379 5 11.1862 5.90789 11.1862 6.96711C11.1862 7.875 11.8207 8.63158 12.6931 8.85855V9.69079H12.0586C11.8207 9.69079 11.6621 9.8421 11.6621 10.0691V10.1447L9.12414 13.625L5.39655 15.4408C5.15862 15.5921 5 15.7434 5 15.8947C5 16.273 5.47586 16.5 6.11034 16.5757L8.96552 22.6283L6.90345 26.4868C6.82414 26.6382 6.74483 26.7895 6.74483 27.0164C6.74483 27.4704 7.14138 27.9243 7.53793 27.9243C7.77586 27.9243 8.01379 27.773 8.17241 27.6217V27.5461L9.83793 24.6711L11.4241 28L11.9 27.773L10.1552 24.2171L12.6931 19.8289H13.9621L16.5 23.9901L15.1517 26.7138C15.0724 26.7895 15.0724 26.9408 15.0724 27.0921C15.0724 27.5461 15.3897 27.9243 15.8655 27.9243C16.1034 27.9243 16.2621 27.8487 16.4207 27.6217C16.5 27.5461 16.5793 27.3947 16.5793 27.3191L17.3724 25.6546L18.0069 26.7895C18.0069 26.8651 18.0862 26.9408 18.0862 27.0921C18.4034 27.5461 18.8793 27.773 19.2759 27.5461C19.5931 27.3947 19.6724 27.0164 19.5931 26.6382L18.1655 23.7632L19.1966 21.5691L23.3207 21.4934L26.1759 27.2434C26.1759 27.3191 26.2552 27.3947 26.2552 27.4704V27.5461C26.4138 27.6974 26.6517 27.8487 26.8897 27.8487C27.3655 27.8487 27.6828 27.4704 27.6828 27.0164C28 26.8651 28 26.7895 28 26.7138ZM11.8207 17.1053L11.0276 18.8454L9.20345 22.1743L6.42759 16.5757C6.74483 16.5 6.98276 16.4243 7.06207 16.3487H7.14138L10.2345 14.7599L11.7414 13.3224L11.8207 16.3487V17.1053Z" fill="white"/>
                              </svg>
                              <div class="ml-4">
                                   <h3 class="text-[14px]">Saint-Ilpize</h3>
                                   <h1 class="text-[30px] font-semibold">PR288 Au Pays De La Terre Cuite</h1>
                              </div>

                         </div>

                         <div class="flex text-left px-6 text-[14px] text-[#606060] mt-3">
                              <div class="bg-[#3866FB] bg-opacity-10 px-2 py-0.5 rounded-[6px]">
                                   Archéologie et histoire
                              </div>
                              <div class="ml-4 bg-[#3866FB] bg-opacity-10 px-2 py-0.5 rounded-[6px]">
                                   Architecture
                              </div>
                              <div class="ml-4 bg-[#3866FB] bg-opacity-10 px-2 py-0.5 rounded-[6px]">
                                   Faune
                              </div>
                              <div class="ml-4 bg-[#3866FB] bg-opacity-10 px-2 py-0.5 rounded-[6px]">
                                   Flore
                              </div>
                              <div class="ml-4 bg-[#3866FB] bg-opacity-10 px-2 py-0.5 rounded-[6px]">
                                   Point de vue
                              </div>
                         </div>
                         <div class="flex text-left px-6 text-[14px] text-[#606060] mt-3">
                              <svg class="my-auto mx-0" width="15" height="16" viewBox="0 0 15 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                                   <g clip-path="url(#clip0_3374_11714)">
                                        <path d="M7.23214 2.37521C10.3393 2.37521 12.8571 4.89307 12.8571 8.00021C12.8571 11.1074 10.3393 13.6252 7.23214 13.6252C4.125 13.6252 1.60714 11.1074 1.60714 8.00021C1.60714 4.89307 4.125 2.37521 7.23214 2.37521ZM7.23214 0.768066C3.24107 0.768066 0 4.00914 0 8.00021C0 11.9913 3.24107 15.2324 7.23214 15.2324C11.2232 15.2324 14.4643 11.9913 14.4643 8.00021C14.4643 4.00914 11.2232 0.768066 7.23214 0.768066Z" fill="#D32F2F"/>
                                        <path d="M7.23218 14.1992C3.82274 14.1992 1.0332 11.4097 1.0332 8.00025C1.0332 4.59081 3.82274 1.80127 7.23218 1.80127C10.6416 1.80127 13.4312 4.59081 13.4312 8.00025C13.4312 11.4097 10.6416 14.1992 7.23218 14.1992Z" fill="white"/>
                                        <path d="M9.376 5.77885C9.376 6.19211 9.24685 6.55372 8.98856 6.83784C8.73027 7.12196 8.36866 7.35442 7.90374 7.48357V7.5094C9.01439 7.63854 9.5568 8.18095 9.5568 9.08497C9.5568 9.70487 9.32434 10.1956 8.83359 10.5314C8.34283 10.8672 7.67128 11.0738 6.79309 11.0738C6.43148 11.0738 6.0957 11.048 5.81158 10.9963C5.52746 10.9447 5.16586 10.8413 4.83008 10.7122V9.21412C5.1142 9.36909 5.42415 9.47241 5.70827 9.54989C5.99239 9.62738 6.27651 9.65321 6.5348 9.65321C6.92223 9.65321 7.20635 9.60155 7.38716 9.49824C7.56796 9.39492 7.64545 9.21412 7.64545 8.98165C7.64545 8.80085 7.59379 8.67171 7.5163 8.56839C7.43882 8.46507 7.28384 8.38759 7.05138 8.33593C6.81892 8.28427 6.61228 8.25844 6.27651 8.25844H5.86324V6.91533H6.27651C7.18052 6.91533 7.64545 6.68287 7.64545 6.21794C7.64545 6.03714 7.56796 5.90799 7.43882 5.83051C7.30967 5.75302 7.12887 5.70136 6.8964 5.70136C6.48314 5.70136 6.04404 5.85634 5.57912 6.14046L4.83008 4.95232C5.19169 4.71986 5.55329 4.53905 5.9149 4.43574C6.27651 4.33242 6.7156 4.28076 7.18052 4.28076C7.87791 4.28076 8.39449 4.40991 8.80776 4.69403C9.22102 4.97815 9.376 5.31392 9.376 5.77885Z" fill="#E53935"/>
                                   </g>
                                   <defs>
                                        <clipPath id="clip0_3374_11714">
                                             <rect width="14.4643" height="14.4643" fill="white" transform="translate(0 0.768066)"/>
                                        </clipPath>
                                   </defs>
                              </svg>
                              <div class="ml-1">
                                   Intermédiaire
                              </div>

                              <svg class="my-auto mx-0 ml-4" width="16" height="15" viewBox="0 0 16 15" fill="none" xmlns="http://www.w3.org/2000/svg">
                                   <path d="M7.5 0C3.36457 0 0 3.36457 0 7.5C0 11.6354 3.36457 15 7.5 15C11.6354 15 15 11.6354 15 7.5C15 3.36457 11.6354 0 7.5 0ZM7.5 14.0625C3.88137 14.0625 0.937504 11.1186 0.937504 7.5C0.937504 3.88137 3.88137 0.937504 7.5 0.937504C11.1186 0.937504 14.0625 3.88137 14.0625 7.5C14.0625 11.1186 11.1186 14.0625 7.5 14.0625Z" fill="#606060"/>
                                   <path d="M7.96875 2.8125H7.03125V7.69408L9.98108 10.6439L10.6439 9.98106L7.96875 7.30589V2.8125Z" fill="#606060"/>
                              </svg>
                              <div class="ml-1">
                                   2h30
                              </div>

                              <svg class="my-auto mx-0 ml-4" width="13" height="14" viewBox="0 0 13 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                   <path d="M5.052 3.47728C4.96948 3.39475 4.86138 3.3535 4.75328 3.3535C4.64518 3.3535 4.53708 3.39475 4.45456 3.47728L1.07456 6.85728C0.909523 7.02231 0.909523 7.28968 1.07456 7.45472L4.45456 10.8347C4.6194 10.9998 4.88717 10.9998 5.052 10.8347C5.21704 10.6697 5.21704 10.4023 5.052 10.2373L1.97072 7.156L5.052 4.07472C5.21704 3.90968 5.21704 3.64231 5.052 3.47728Z" fill="#606060"/>
                                   <path d="M8.2682 10.9585C8.3763 10.9585 8.4844 10.9173 8.56692 10.8347L11.9469 7.45474C12.112 7.2897 12.112 7.02233 11.9469 6.85729L8.56692 3.47729C8.40209 3.31226 8.13432 3.31226 7.96948 3.47729C7.80444 3.64233 7.80444 3.9097 7.96948 4.07474L11.0508 7.15602L7.96948 10.2373C7.80444 10.4023 7.80444 10.6697 7.96948 10.8347C8.052 10.9173 8.1601 10.9585 8.2682 10.9585Z" fill="#606060"/>
                              </svg>
                              <div class="ml-1">
                                   7,6km
                              </div>

                              <svg class="my-auto mx-0 ml-4" width="12" height="10" viewBox="0 0 12 10" fill="none" xmlns="http://www.w3.org/2000/svg">
                                   <g clip-path="url(#clip0_3374_11734)">
                                        <path d="M4.14175 4.1935C4.24297 4.07626 4.38024 4.01039 4.52337 4.01039C4.6665 4.01039 4.80378 4.07626 4.90499 4.1935L6.23183 5.73074L9.678 1.73827H8.25886C7.96083 1.73827 7.71918 1.45831 7.71918 1.11303C7.71918 0.76775 7.96083 0.487793 8.25886 0.487793H10.9809C11.2789 0.487793 11.5206 0.76775 11.5206 1.11303V4.19951C11.5206 4.54479 11.2789 4.82475 10.9809 4.82475C10.6828 4.82475 10.4412 4.54479 10.4412 4.19951V2.62256L6.61344 7.0571C6.51223 7.17434 6.37496 7.24021 6.23183 7.24021C6.08869 7.24021 5.95142 7.17434 5.85021 7.0571L4.52337 5.51986L1.34319 9.20421C1.13246 9.44836 0.790692 9.44836 0.579958 9.20421C0.369181 8.96002 0.369181 8.56417 0.579958 8.31998L4.14175 4.1935Z" fill="#606060"/>
                                   </g>
                                   <defs>
                                        <clipPath id="clip0_3374_11734">
                                             <rect width="12" height="10" fill="white"/>
                                        </clipPath>
                                   </defs>
                              </svg>
                              <div class="ml-1">
                                   +304m
                              </div>

                              <svg class="my-auto mx-0 ml-4" width="12" height="10" viewBox="0 0 12 10" fill="none" xmlns="http://www.w3.org/2000/svg">
                                   <g clip-path="url(#clip0_3374_11739)">
                                        <path d="M4.14175 5.6815C4.24297 5.79874 4.38024 5.86461 4.52337 5.86461C4.6665 5.86461 4.80378 5.79874 4.90499 5.6815L6.23183 4.14426L9.678 8.13673H8.25886C7.96083 8.13673 7.71918 8.41669 7.71918 8.76197C7.71918 9.10725 7.96083 9.38721 8.25886 9.38721H10.9809C11.2789 9.38721 11.5206 9.10725 11.5206 8.76197V5.67549C11.5206 5.33021 11.2789 5.05025 10.9809 5.05025C10.6828 5.05025 10.4412 5.33021 10.4412 5.67549V7.25244L6.61344 2.8179C6.51223 2.70066 6.37496 2.63479 6.23183 2.63479C6.08869 2.63479 5.95142 2.70066 5.85021 2.8179L4.52337 4.35514L1.34319 0.670786C1.13246 0.426643 0.790692 0.426643 0.579958 0.670786C0.369181 0.914979 0.369181 1.31083 0.579958 1.55502L4.14175 5.6815Z" fill="#606060"/>
                                   </g>
                                   <defs>
                                        <clipPath id="clip0_3374_11739">
                                             <rect width="12" height="10" fill="white"/>
                                        </clipPath>
                                   </defs>
                              </svg>
                              <div class="ml-1">
                                   +304m
                              </div>

                              <svg class="my-auto mx-0 ml-4" width="17" height="15" viewBox="0 0 17 15" fill="none" xmlns="http://www.w3.org/2000/svg">
                                   <path d="M8.64609 13.9922C7.68984 13.9922 6.90625 13.3008 6.90625 12.457C6.90625 11.6133 7.68984 10.9219 8.64609 10.9219C9.60234 10.9219 10.3859 11.6133 10.3859 12.457C10.3859 13.3008 9.60234 13.9922 8.64609 13.9922ZM8.64609 12.0938C8.42031 12.0938 8.23438 12.2578 8.23438 12.457C8.23438 12.6563 8.42031 12.8203 8.64609 12.8203C8.87187 12.8203 9.05781 12.6563 9.05781 12.457C9.05781 12.2578 8.87187 12.0938 8.64609 12.0938Z" fill="#606060"/>
                                   <path d="M9.65508 13.2539C9.52227 13.2539 9.38946 13.2071 9.29649 13.1133C9.12383 12.9375 9.1504 12.6797 9.34961 12.5391C9.40274 12.5039 14.6754 8.43753 14.8746 5.00393C14.9277 4.07815 14.609 3.293 13.8918 2.63675C11.727 0.609404 10.0668 1.6055 7.53008 3.39847C6.10899 4.38284 4.66133 5.41409 2.98789 5.56643C2.61602 5.60159 2.39024 5.69534 2.33711 5.84768C2.25743 6.0469 2.21758 6.87893 4.72774 9.38675C6.13555 10.793 7.64961 12.0235 7.6629 12.0352C7.84883 12.1875 7.86211 12.4453 7.68946 12.6094C7.5168 12.7735 7.22461 12.7852 7.03868 12.6328C7.02539 12.6211 5.48477 11.3672 4.03711 9.92581C1.28789 7.19534 1.24805 6.14065 1.46055 5.58987C1.58008 5.25003 1.93868 4.83987 2.90821 4.75784C4.30274 4.64065 5.64415 3.67972 6.95899 2.75394C9.17696 1.1719 11.7004 -0.609346 14.5691 2.06253C15.459 2.88284 15.8707 3.89065 15.8043 5.03909C15.5918 8.82425 10.1996 12.9727 9.96055 13.1485C9.86758 13.2188 9.76133 13.2539 9.65508 13.2539Z" fill="#606060"/>
                              </svg>
                              <div class="ml-1">
                                   Boucle
                              </div>

                              <svg class="my-auto mx-0 ml-4" width="16" height="15" viewBox="0 0 16 15" fill="none" xmlns="http://www.w3.org/2000/svg">
                                   <path d="M0.542969 5.59326H15.3905V9.40678H0.542969V5.59326Z" fill="#F9D411"/>
                              </svg>
                              <div class="ml-1">
                                   PR
                              </div>
                         </div>
                    </div>
                    <div class = "overflow-y-auto max-h-[414px] mt-[15px] mb-[15px]">
                         <div class="flex flex-col text-left px-6">
                              <p class="text-[16px] text-[#000]">
                                   Saint-Ilpize sous tous les angles : le site perché sur son piton de basalte, les remparts, le village étagé sur l’abrupt rocheux, la tour du château et la chapelle qui coiffent l’ensemble. Vous pourrez admirez la vue sur la vallée et les vestiges du vignoble de la Ribeyre.
                              </p>
                         </div>
                         <div class="flex flex-col text-left px-6">
                              <p class="text-[16px] text-[#606060] mt-3">
                                   Le pont suspendu sur l’Allier <br>
                                   Achevé en 1879, le pont suspendu, construit par l’ingénieur Ferdinand Arnodin, a remplacé le bac devenu dangereux à cause des nombreuses crues de l’Allier. Il s’agissait d’un ouvrage de dernière génération, avec un système de haubans destiné à maintenir le tablier. Celui-ci a été remplacé par un tablier métallique en 1970 permettant ainsi de faire passer la charge admissible à 16 tonnes. Le tablier est renforcé par des poutres latérales qui servent de garde-corps. En raison de défaillances, le pont est actuellement interdit aux poids lourds et aux véhicules hors gabarit. Un gué, situé quelques centaines de mètres en aval, permet à ces véhicules de franchir la rivière.
                              </p>
                              <p class="text-[16px] text-[#606060] mt-3">
                                   Le pont suspendu sur l’Allier <br>
                                   Achevé en 1879, le pont suspendu, construit par l’ingénieur Ferdinand Arnodin, a remplacé le bac devenu dangereux à cause des nombreuses crues de l’Allier. Il s’agissait d’un ouvrage de dernière génération, avec un système de haubans destiné à maintenir le tablier. Celui-ci a été remplacé par un tablier métallique en 1970 permettant ainsi de faire passer la charge admissible à 16 tonnes. Le tablier est renforcé par des poutres latérales qui servent de garde-corps. En raison de défaillances, le pont est actuellement interdit aux poids lourds et aux véhicules hors gabarit. Un gué, situé quelques centaines de mètres en aval, permet à ces véhicules de franchir la rivière.
                              </p>
                         </div>
                         <hr class="border-black border-opacity-20 border-1 w-3/4 mx-auto mt-4"/>
                    </div>
               </div>
          </div>
     </ChatModalBaseExt>
</template>
<script setup lang="ts">
const { t } = useI18n()
const emit = defineEmits(['close'])
</script>
